/**
 * 作者：大火兔 1979788761@qq.com
 * 时间：2019-05-18
 * 功能：常用表单正则表达式
 * 描述：支持node环境下，node，vue，react,angular,小程序
 * 特别说明:本JS插件库只兼容支持HTML5的浏览器，包括移动端、PC端，最低兼容IE9及以上。
 **/

var regexs = {
  //字符格式
  string: {
    char: /!/,
    //帐号（字母开头，允许 5-16 字节，允许字母数字下划线）
    username: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/,
    //由数字、26个英文字母或下划线组成的字符串
    username1: /^\w+$/,
    //验证用户密码,正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。
    password: /^[a-zA-Z]\w{5,17}$/,
    //密码的强度，必须是包含大小写字母和数字的组合，不能使用特殊字符，长度在4-32之间。
    password1: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{4,32}$/,
    //中文
    chinese: /^[\u4e00-\u9fa5]{0,}$/,
    //英文
    english: /^[A-Za-z]+$/,
    //验证由26个大写英文字母组成的字符串
    english_max: /^[A-Z]+$/,
    //验证由26个小写英文字母组成的字符串
    english_min: /^[a-z]+$/,
    //验证由数字和26个英文字母组成的字符串
    english_number: /^[A-Za-z0-9]+$/,
    //中文、英文、数字及下划线
    allchar: /^[\u4e00-\u9fa5_a-zA-Z0-9]+$/,
    //SQL语句
    sql: /^(select|drop|delete|create|update|insert).*$/,
  },
  //数字格式
  number: {
    //整数
    int: /^ -?\d+$/,
    //非零开头的数字
    non_zero: /^(0|[1-9][0-9]*)$/,
    //金额，精确到2位小数
    money: /^[0-9]+(.[0-9]{2})?$/,
    //百分比
    percent: /^(?:[1-9][0-9]?|100)(?:\.[0-9]{1,2})?$/,
    //整数
    integer: /^-?[1-9]\d*$/,
    //正整数
    positive_int: /^[1-9]\d*$/,
    //负整数
    negtive_int: /^-[1-9]\d*$/,
    //非正整数（负整数 + 0）
    non_positive_int: /^-[1-9]\d*|0$/,
    //非负整数（正整数 + 0）
    non_negtive_int: /^[1-9]\d*|0$/,
    //浮点数 
    float: /^(-?\d+)(\.\d+)?$/,
    //正浮点数 
    positive_float: /^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$/,
    //负浮点数 
    negtive_float: /^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/,
    //非负浮点数（正浮点数 + 0）
    non_negtive_float: /^\d+(\.\d+)?$/,
    //非正浮点数（负浮点数 + 0） 
    non_positive_float: /^((-\d+(\.\d+)?)|(0+(\.0+)?))$/,
  },
  //时间日期格式
  datetime: {
    //一年的12个月,正确格式为：“01”-“09”和“1”“12”
    months: /^(0?[1-9]|1[0-2])$/,
    //一个月的31天, 正确格式为：01、09和1、31。
    days: /^((0?[1-9])|((1|2)[0-9])|30|31)$/,
    //yyyy-mm-dd格式的日期，含平闰年
    date: /^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$/,
    //yyyy/mm/dd iOS下格式日期 
    iosdate: /^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])$/,
  },
  //网页相关
  html: {
    //颜色值
    color: /^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})$/,
  },
  //邮件相关
  email: {
    //Email地址
    mail: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
  },
  //号码相关
  phone: {
    //中国大陆手机号 (移动/联通/电信)
    mobile: /^[1]([3-9])[0-9]{9}$/,
    //中国移动手机号码（134,135,136,137,138,139,150,151,152,157,158,159,182,183,184,187,188,147,178,1705）
    cmcc: /^(^1(3[4-9]|4[7]|5[0-27-9]|7[8]|8[2-478])\d{8}$)|(^1705\d{7}$)$/,
    //中国联通手机号码（130, 131, 132, 155, 156, 185, 186, 145, 176, 1709）
    cucc: /^(^1(3[0-2]|4[5]|5[56]|7[6]|8[56])\d{8}$)|(^1709\d{7}$)$/,
    //中国电信手机号码（133,153,180,181,189,177,1700）
    ctcc: /^(^1(33|53|77|8[019])\d{8}$)|(^1700\d{7}$)$/,
    //电话区号
    area: /^0\d{2,3}$/,
    //电话号码，正确格式：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。
    tel: /^(\(\d{3,4}\)|\d{3,4}-)?\d{7,8}$/,
    //传真，电话号码，格式：国家代码(2到3位)-区号(2到3位)-电话号码(7到8位)-分机号(3位)
    fax: /^(([0\+]\d{2,3}-)?(0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/,
  },
  //链接相关
  link: {
    //网址URL包括（http,https,ftp,sftp）
    url: /^[a-zA-z]+:\/\/[^\s]*$/,
    //http网址
    http: /^http?:\/\/.+$/,
    //https网址
    https: /^https?:\/\/.+$/,
    //ftp地址
    ftp: /^ftp?:\/\/.+$/,
    //sftp地址
    sftp: /^sftp?:\/\/.+$/,
  },
  //身份证相关
  idcard: {
    //18位身份证号码
    n18: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X|x)$/,
    //15位身份证号码
    n15: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/,
  },
  //社交账号
  im: {
    //QQ号码
    qq: /^[1-9][0-9]{4,10}$/,
  },
  //IP地址
  ip: {
    //IP4格式
    ip4: /^((2[0-4]\d|25[0-5]|[01]?\d\d?)\.){3}(2[0-4]\d|25[0-5]|[01]?\d\d?)$/,
    //IP6格式
    ip6: /^\s*((([0-9A-Fa-f]{1,4}:){7}([0-9A-Fa-f]{1,4}|:))|(([0-9A-Fa-f]{1,4}:){6}(:[0-9A-Fa-f]{1,4}|((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){5}(((:[0-9A-Fa-f]{1,4}){1,2})|:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){4}(((:[0-9A-Fa-f]{1,4}){1,3})|((:[0-9A-Fa-f]{1,4})?:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){3}(((:[0-9A-Fa-f]{1,4}){1,4})|((:[0-9A-Fa-f]{1,4}){0,2}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){2}(((:[0-9A-Fa-f]{1,4}){1,5})|((:[0-9A-Fa-f]{1,4}){0,3}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){1}(((:[0-9A-Fa-f]{1,4}){1,6})|((:[0-9A-Fa-f]{1,4}){0,4}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(:(((:[0-9A-Fa-f]{1,4}){1,7})|((:[0-9A-Fa-f]{1,4}){0,5}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:)))(%.+)?\s*$/,
  },
  //邮政编码
  postcode: /^[0-9][0-9]{5}$/,
  /**
   * 不常用扩展正则
   **/
  extension: {
    // //匹配n位的数字
    // rule: /^\d{n}$/,
    // //匹配至少n位数字
    // rule: /^\d{n,}$/,
    // //匹配m-n位的数字
    // rule: /^\d{m,n}$/,
    // //匹配有两位小数的正实数
    // rule: /^[0-9]+(.[0-9]{2})?$/,
    // //匹配有1-3位小数的正实数：
    // rule: /^[0-9]+(.[0-9]{1,3})?$/,
    // //匹配长度为3的字符：
    // rule: /^.{3}$/,
    // //匹配是否含有 ^%&',;=?$\" 等字符
    // rule: /[^%&',;=?$\x22]+/,
    // //匹配双字节字符
    // rule: /[^\x00-\xff]/,
    // //匹配空白行的正则表达式
    // rule: /\n\s*\r/,
    // //匹配首尾空白字符的正则表达式
    // rule: /^\s*|\s*$/,
    // //匹配信息中的浮点数（即小数）
    // rule: /(-?\d*)\.?\d+/,
    // //匹配信息中的任何数字
    //rule: /(-?\d*)(\.\d+)?/,
    //匹配安卓或iOS系统
    system: /iOS|Android/,
    //匹配版本号
    version: /\d+(\.\d+)+/,
  },
};

module.exports = regexs;